import type { EmployeeList } from "@/lib/types";
import { generateId } from "@/lib/utils";

export const NURSES_EMPLOYEE_LIST_ID = "nurses";

const NURSE_NAMES = [
  "Абрамова Е.Ф.",
  "Алексеев С.В.",
  "Арабкаева Т.А.",
  "Багаева Т.С.",
  "Буцак А.Н.",
  "Вересова Ж.В.",
  "Внукова Д.В.",
  "Воронина О.Н.",
  "Воронова С.В.",
  "Гартвиг О.А.",
  "Гензе Е.В.",
  "Грицан А.С.",
  "Губер Л.В.",
  "Девятерекова Ю.А.",
  "Денисов А.А.",
  "Доманова М.Д.",
  "Донова Н.В.",
  "Епифанова Е.Е.",
  "Иванов О.В.",
  "Казакеева Ю.А.",
  "Калягина Ю.С.",
  "Кинцель С.К.",
  "Киркач Л.В.",
  "Кулябина И.П.",
  "Лалетина Е.А.",
  "Ларионов Е.В.",
  "Ларионова И.И.",
  "Леконцева Т.А.",
  "Лелякова Н.В.",
  "Матухно К.В.",
  "Мехта Д.А.",
  "Мокина Н.В.",
  "Москалева М.С.",
  "Мусаева Е.В.",
  "Мухторова О.С.",
  "Осипова Е.В.",
  "Плеханова Е.А.",
  "Помалева М.В.",
  "Рамазанова А.Э.",
  "Садыко М.Ю.",
  "Сафина Р.Н.",
  "Семенова К.К.",
  "Сибуль О.Э.",
  "Смолянская Е.В.",
  "Солодихина О.М.",
  "Спирина А.П.",
  "Страшко Л.В.",
  "Суханов В.Р.",
  "Терехова П.А.",
  "Фокин А.Р.",
  "Хмарская А.О.",
  "Чистякова Е.В.",
  "Чурсанова Ю.С.",
  "Шароглазова Т.И.",
  "Юшина Е.И.",
];

function createMember(name: string) {
  return { id: generateId(), name, dutyPreferences: [] };
}

export const NURSES_EMPLOYEE_LIST: EmployeeList = {
  id: NURSES_EMPLOYEE_LIST_ID,
  name: "Ср. мед персонал",
  members: NURSE_NAMES.map(createMember),
};
